app/controllers/home_controller.rb

  def index
    @questions = Question.latest
---
SELECT * FROM `questions` ORDER BY created_at DESC