app/controllers/questions_controller.rb

SELECT `questions`.* FROM `questions` JOIN taggings questions_taggings_actsastaggableon_962 ON questions_taggings_actsastaggableon_962.taggable_id = questions.id AND questions_taggings_actsastaggableon_962.taggable_type = 'Question' JOIN tags questions_tags_actsastaggableon_962 ON questions_tags_actsastaggableon_962.id = questions_taggings_actsastaggableon_962.tag_id AND questions_tags_actsastaggableon_962.name like 'acts_as_taggable_on' ORDER BY created_at DESC
SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.id = `taggings`.tag_id WHERE ((`taggings`.taggable_id = 6) AND (`taggings`.taggable_type = 'Question') AND ((taggings.context = 'tags')))
SELECT count(*) AS count_all FROM `users` WHERE (last_request_at > '2009-11-12 14:00:22')
---
  def index
      if (params[:tag].present?)
        @questions = Question.latest.tagged_with(params[:tag]).paginate :page => params[:page], :per_page => 15
      else
        @questions = Question.latest.includes([:user,:votes]).paginate :page => params[:page], :per_page => 15

SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
UPDATE `questions` SET `views` = 1, `updated_at` = '2009-11-13 21:42:12' WHERE `id` = 1
---
  def show
    @question = Question.find(params[:id])
    @question.update_views if @question.present?

SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
---
  def edit
    @question = Question.find(params[:id])

INSERT INTO `questions` (`name`, `created_at`, `body`, `updated_at`, `views`, `user_id`) VALUES('Wann kommt FLOW4?', '2009-11-13 14:22:36', 'Keine Ahnung! Und ihr?', '2009-11-13 14:22:36', NULL, NULL)
---
  def create
    @question = Question.new(params[:question])
    @question.user = current_user
      respond_to do |format|
        if @question.save