app/controllers/tags_controller.rb

  def index

    if params[:tags].present? && params[:tags][:q].present?
      @q = params[:tags][:q]
      @tags = ActsAsTaggableOn::Tag.group('tags.id').joins(:taggings).select("count(*) as count,tags.id,tags.name").order('count(*) desc').where("name like ?","#{params[:tags][:q]}%").paginate :page => params[:page], :per_page => 60

    else
      @q = "Search ..."
      @tags = ActsAsTaggableOn::Tag.group('tags.id').joins(:taggings).select("count(*) as count,tags.id,tags.name").order('count(*) desc').paginate :page => params[:page], :per_page => 60
    end

    respond_to do |format|
      format.html {}
      format.js{ render :partial => "list"}
      format.json{ render :json => @tags.map { |tag| tag.name}.to_json }
---
SELECT * FROM `tags` WHERE (name LIKE 'r')
SELECT tags.id, tags.name, COUNT(*) AS count FROM `tags` LEFT OUTER JOIN taggings ON tags.id = taggings.tag_id AND taggings.context = 'tags' INNER JOIN questions ON questions.id = taggings.taggable_id JOIN taggings questions_taggings_ruby_1016 ON questions_taggings_ruby_1016.taggable_id = questions.id AND questions_taggings_ruby_1016.taggable_type = 'Question' JOIN tags questions_tags_ruby_1016 ON questions_tags_ruby_1016.id = questions_taggings_ruby_1016.tag_id AND questions_tags_ruby_1016.name like 'ruby' WHERE ((taggings.taggable_type = 'Question')) GROUP BY tags.id, tags.name HAVING COUNT(*) > 0
SELECT * FROM `tags` WHERE (`tags`.`name` = 'ruby%') LIMIT 1