app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `last_request_at`, `crypted_password`, `updated_at`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`) VALUES('2009-11-12 09:21:13', '2009-11-12 09:21:13', '556618af8e1c9af3b2a83c5dd6ee52dc0ec1755ce837f7e6ace4a9b0d48e15881e4c6bd4ef7aea9743947a4be9b6c21714504abb1074b1bbc71957cc6533463a', '2009-11-12 09:21:13', '::1', 'E92TDn7-aMVnQQbui-xH', '2009-11-12 09:21:13', 'ca84cd1d8be16f3f9a2ad314ea6dbcfa13ca9a3eeedd3d9aa13568d699564a0389063221ac03e4241ca8b8635cb1755200574f58a2b09b1f67536b4c4812d37f', 1, NULL, 'kieran', NULL)
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
SELECT count(*) AS count_all FROM `users` WHERE (last_request_at > '2009-11-12 09:11:13')
---
  def show
    @user = User.find(params[:id])
    @user.count_view unless current_user == @user

UPDATE `users` SET `updated_at` = '2009-11-12 14:13:22', `last_request_at` = '2009-11-12 14:13:22' WHERE `id` = 1
---
  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])