app/controllers/users_controller.rb

  def load_user
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1